---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailLateralOffset
source: html/01e960f6-9041-e2e7-9c9b-87fceee9a7b1.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailLateralOffset Property

The lateral offset of the secondary handrail.

## Syntax (C#)
```csharp
public double SecondaryHandrailLateralOffset { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The rail has no secondary hand rail.